In [1]:
import pandas as pd
import numpy as np

In [ ]:
1.데이터프레임 만들기

In [54]:
df_score2 = pd.DataFrame({'반': ['A', 'A', 'A', 'A', 'A', 'B', 'B','B', 'B','B'],
'번호': ['1','2','3','4','5','1','2','3','4','5'],
'국어' : [90, 80, 90, 70, 100, 80, 90, 100, 70,80],
'영어' : [100, 90, 100, 80, 70, 90, 100, 70, 80,90],
'수학' : [80, 100, 80, 90, 80, 100, 70, 80, 90,100]
})
df_score2

   반 번호   국어   영어   수학
0  A  1   90  100   80
1  A  2   80   90  100
2  A  3   90  100   80
3  A  4   70   80   90
4  A  5  100   70   80
5  B  1   80   90  100
6  B  2   90  100   70
7  B  3  100   70   80
8  B  4   70   80   90
9  B  5   80   90  100

In [ ]:
2. 데이터프레임 변형

In [55]:
df_score2 = pd.DataFrame({'반': ['A', 'A', 'A', 'A', 'A', 'B', 'B','B', 'B','B'],
'번호': ['1','2','3','4','5','1','2','3','4','5'],
'국어' : [90, 80, 90, 70, 100, 80, 90, 100, 70,80],
'영어' : [100, 90, 100, 80, 70, 90, 100, 70, 80,90],
'수학' : [80, 100, 80, 90, 80, 100, 70, 80, 90,100]
})
df_score3=df_score2.pivot_table(index=['반','번호'])

In [79]:
df_score3['평균']=df_score3.mean(axis=1)
df_score3

       국어   수학   영어         평균
반 번호
A 1    90   80  100  90.000000
  2    80  100   90  90.000000
  3    90   80  100  90.000000
  4    70   90   80  80.000000
  5   100   80   70  83.333333
B 1    80  100   90  90.000000
  2    90   70  100  86.666667
  3   100   80   70  83.333333
  4    70   90   80  80.000000
  5    80  100   90  90.000000

In [ ]:
3. 평균 옆에 더하기

In [80]:
df_score3['평균']=df_score3.mean(axis=1)
df_score3

       국어   수학   영어         평균
반 번호
A 1    90   80  100  90.000000
  2    80  100   90  90.000000
  3    90   80  100  90.000000
  4    70   90   80  80.000000
  5   100   80   70  83.333333
B 1    80  100   90  90.000000
  2    90   70  100  86.666667
  3   100   80   70  83.333333
  4    70   90   80  80.000000
  5    80  100   90  90.000000

In [ ]:
4. 데이터프레임 변경, 행,열 인덱스 바꾸기

In [89]:
df_score2 = pd.DataFrame({'반': ['A', 'A', 'A', 'A', 'A', 'B', 'B','B', 'B','B'],
'번호': ['1','2','3','4','5','1','2','3','4','5'],
'국어' : [90, 80, 90, 70, 100, 80, 90, 100, 70,80],
'영어' : [100, 90, 100, 80, 70, 90, 100, 70, 80,90],
'수학' : [80, 100, 80, 90, 80, 100, 70, 80, 90,100]
})
df_score4=df_score2.set_index('번호')

In [90]:
df_score4

    반   국어   영어   수학
번호
1   A   90  100   80
2   A   80   90  100
3   A   90  100   80
4   A   70   80   90
5   A  100   70   80
1   B   80   90  100
2   B   90  100   70
3   B  100   70   80
4   B   70   80   90
5   B   80   90  100

In [ ]:
6. 이진법으로 큰 수중 가장 작은 숫자 찾기

In [94]:
a=bin(78)

In [97]:
a[2:]

'1001110'

In [150]:
def No_1finder(dec):
    binary=np.binary_repr(dec)
    No_1=0
    for i in range(0,len(binary)):
        if int(binary[i])==1:
              No_1+=1
        else:
            pass
    return No_1
n=78

4

In [143]:
np.binary_repr(78)

'1'

In [140]:
count=0
for i in range(0,len(bin(78)[2:])):
    if int(bin(78)[2:][i])==1:
              count+=1
    else:
        pass
print(count)

4

str

In [134]:
len(bin(78)[2:])

7